zephyrproject-rtos/hal_atmel/asf/sam/include/sam4l/pio/sam4lc2c.h
#define GPIO_PB12B_SPI_NPCS3     _UL(1 << 12)
#define PIN_PC01A_SPI_NPCS3            _L(65) /**< \brief SPI signal: NPCS3 on PC01 mux A */
#define MUX_PC01A_SPI_NPCS3             _L(0)
#define PINMUX_PC01A_SPI_NPCS3     ((PIN_PC01A_SPI_NPCS3 << 16) | MUX_PC01A_SPI_NPCS3)
#define GPIO_PC01A_SPI_NPCS3     _UL(1 <<  1)
#define PIN_PC30B_SPI_SCK              _L(94) /**< \brief SPI signal: SCK on PC30 mux B */
#define MUX_PC30B_SPI_SCK               _L(1)
#define PINMUX_PC30B_SPI_SCK       ((PIN_PC30B_SPI_SCK << 16) | MUX_PC30B_SPI_SCK)
#define GPIO_PC30B_SPI_SCK       _UL(1 << 30)
#define PIN_PA23A_SPI_SCK              _L(23) /**< \brief SPI signal: SCK on PA23 mux A */
#define MUX_PA23A_SPI_SCK               _L(0)
#define PINMUX_PA23A_SPI_SCK       ((PIN_PA23A_SPI_SCK << 16) | MUX_PA23A_SPI_SCK)
#define GPIO_PA23A_SPI_SCK       _UL(1 << 23)
#define PIN_PC06A_SPI_SCK              _L(70) /**< \brief SPI signal: SCK on PC06 mux A */
#define MUX_PC06A_SPI_SCK               _L(0)
#define PINMUX_PC06A_SPI_SCK       ((PIN_PC06A_SPI_SCK << 16) | MUX_PC06A_SPI_SCK)
#define GPIO_PC06A_SPI_SCK       _UL(1 <<  6)
/* ========== GPIO definition for TC0 peripheral ========== */
#define PIN_PB07D_TC0_A0               _L(39) /**< \brief TC0 signal: A0 on PB07 mux D */
#define MUX_PB07D_TC0_A0                _L(3)
#define PINMUX_PB07D_TC0_A0        ((PIN_PB07D_TC0_A0 << 16) | MUX_PB07D_TC0_A0)
#define GPIO_PB07D_TC0_A0        _UL(1 <<  7)
#define PIN_PA08B_TC0_A0                _L(8) /**< \brief TC0 signal: A0 on PA08 mux B */
#define MUX_PA08B_TC0_A0                _L(1)
#define PINMUX_PA08B_TC0_A0        ((PIN_PA08B_TC0_A0 << 16) | MUX_PA08B_TC0_A0)
#define GPIO_PA08B_TC0_A0        _UL(1 <<  8)
#define PIN_PB09D_TC0_A1               _L(41) /**< \brief TC0 signal: A1 on PB09 mux D */
#define MUX_PB09D_TC0_A1                _L(3)
#define PINMUX_PB09D_TC0_A1        ((PIN_PB09D_TC0_A1 << 16) | MUX_PB09D_TC0_A1)
#define GPIO_PB09D_TC0_A1        _UL(1 <<  9)
#define PIN_PA10B_TC0_A1               _L(10) /**< \brief TC0 signal: A1 on PA10 mux B */
#define MUX_PA10B_TC0_A1                _L(1)
#define PINMUX_PA10B_TC0_A1        ((PIN_PA10B_TC0_A1 << 16) | MUX_PA10B_TC0_A1)
#define GPIO_PA10B_TC0_A1        _UL(1 << 10)
#define PIN_PB11D_TC0_A2               _L(43) /**< \brief TC0 signal: A2 on PB11 mux D */
#define MUX_PB11D_TC0_A2                _L(3)
#define PINMUX_PB11D_TC0_A2        ((PIN_PB11D_TC0_A2 << 16) | MUX_PB11D_TC0_A2)
#define GPIO_PB11D_TC0_A2        _UL(1 << 11)
#define PIN_PA12B_TC0_A2               _L(12) /**< \brief TC0 signal: A2 on PA12 mux B */
#define MUX_PA12B_TC0_A2                _L(1)
#define PINMUX_PA12B_TC0_A2        ((PIN_PA12B_TC0_A2 << 16) | MUX_PA12B_TC0_A2)
#define GPIO_PA12B_TC0_A2        _UL(1 << 12)
#define PIN_PB08D_TC0_B0               _L(40) /**< \brief TC0 signal: B0 on PB08 mux D */
#define MUX_PB08D_TC0_B0                _L(3)
#define PINMUX_PB08D_TC0_B0        ((PIN_PB08D_TC0_B0 << 16) | MUX_PB08D_TC0_B0)
#define GPIO_PB08D_TC0_B0        _UL(1 <<  8)
#define PIN_PA09B_TC0_B0                _L(9) /**< \brief TC0 signal: B0 on PA09 mux B */
#define MUX_PA09B_TC0_B0                _L(1)
#define PINMUX_PA09B_TC0_B0        ((PIN_PA09B_TC0_B0 << 16) | MUX_PA09B_TC0_B0)
#define GPIO_PA09B_TC0_B0        _UL(1 <<  9)
#define PIN_PB10D_TC0_B1               _L(42) /**< \brief TC0 signal: B1 on PB10 mux D */
#define MUX_PB10D_TC0_B1                _L(3)
#define PINMUX_PB10D_TC0_B1        ((PIN_PB10D_TC0_B1 << 16) | MUX_PB10D_TC0_B1)
#define GPIO_PB10D_TC0_B1        _UL(1 << 10)
#define PIN_PA11B_TC0_B1               _L(11) /**< \brief TC0 signal: B1 on PA11 mux B */
#define MUX_PA11B_TC0_B1                _L(1)
#define PINMUX_PA11B_TC0_B1        ((PIN_PA11B_TC0_B1 << 16) | MUX_PA11B_TC0_B1)
#define GPIO_PA11B_TC0_B1        _UL(1 << 11)
#define PIN_PB12D_TC0_B2               _L(44) /**< \brief TC0 signal: B2 on PB12 mux D */
#define MUX_PB12D_TC0_B2                _L(3)
#define PINMUX_PB12D_TC0_B2        ((PIN_PB12D_TC0_B2 << 16) | MUX_PB12D_TC0_B2)
#define GPIO_PB12D_TC0_B2        _UL(1 << 12)
#define PIN_PA13B_TC0_B2               _L(13) /**< \brief TC0 signal: B2 on PA13 mux B */
#define MUX_PA13B_TC0_B2                _L(1)
#define PINMUX_PA13B_TC0_B2        ((PIN_PA13B_TC0_B2 << 16) | MUX_PA13B_TC0_B2)
#define GPIO_PA13B_TC0_B2        _UL(1 << 13)
#define PIN_PB13D_TC0_CLK0             _L(45) /**< \brief TC0 signal: CLK0 on PB13 mux D */
#define MUX_PB13D_TC0_CLK0              _L(3)
#define PINMUX_PB13D_TC0_CLK0      ((PIN_PB13D_TC0_CLK0 << 16) | MUX_PB13D_TC0_CLK0)
#define GPIO_PB13D_TC0_CLK0      _UL(1 << 13)
#define PIN_PA14B_TC0_CLK0             _L(14) /**< \brief TC0 signal: CLK0 on PA14 mux B */
#define MUX_PA14B_TC0_CLK0              _L(1)
#define PINMUX_PA14B_TC0_CLK0      ((PIN_PA14B_TC0_CLK0 << 16) | MUX_PA14B_TC0_CLK0)
#define GPIO_PA14B_TC0_CLK0      _UL(1 << 14)
#define PIN_PB14D_TC0_CLK1             _L(46) /**< \brief TC0 signal: CLK1 on PB14 mux D */
#define MUX_PB14D_TC0_CLK1              _L(3)
#define PINMUX_PB14D_TC0_CLK1      ((PIN_PB14D_TC0_CLK1 << 16) | MUX_PB14D_TC0_CLK1)
#define GPIO_PB14D_TC0_CLK1      _UL(1 << 14)
#define PIN_PA15B_TC0_CLK1             _L(15) /**< \brief TC0 signal: CLK1 on PA15 mux B */
#define MUX_PA15B_TC0_CLK1              _L(1)
#define PINMUX_PA15B_TC0_CLK1      ((PIN_PA15B_TC0_CLK1 << 16) | MUX_PA15B_TC0_CLK1)
#define GPIO_PA15B_TC0_CLK1      _UL(1 << 15)
#define PIN_PB15D_TC0_CLK2             _L(47) /**< \brief TC0 signal: CLK2 on PB15 mux D */
#define MUX_PB15D_TC0_CLK2              _L(3)
#define PINMUX_PB15D_TC0_CLK2      ((PIN_PB15D_TC0_CLK2 << 16) | MUX_PB15D_TC0_CLK2)
#define GPIO_PB15D_TC0_CLK2      _UL(1 << 15)
#define PIN_PA16B_TC0_CLK2             _L(16) /**< \brief TC0 signal: CLK2 on PA16 mux B */
#define MUX_PA16B_TC0_CLK2              _L(1)
#define PINMUX_PA16B_TC0_CLK2      ((PIN_PA16B_TC0_CLK2 << 16) | MUX_PA16B_TC0_CLK2)
#define GPIO_PA16B_TC0_CLK2      _UL(1 << 16)
/* ========== GPIO definition for TC1 peripheral ========== */
#define PIN_PC00D_TC1_A0               _L(64) /**< \brief TC1 signal: A0 on PC00 mux D */
#define MUX_PC00D_TC1_A0                _L(3)
#define PINMUX_PC00D_TC1_A0        ((PIN_PC00D_TC1_A0 << 16) | MUX_PC00D_TC1_A0)
#define GPIO_PC00D_TC1_A0        _UL(1 <<  0)
#define PIN_PC15A_TC1_A0               _L(79) /**< \brief TC1 signal: A0 on PC15 mux A */
#define MUX_PC15A_TC1_A0                _L(0)
#define PINMUX_PC15A_TC1_A0        ((PIN_PC15A_TC1_A0 << 16) | MUX_PC15A_TC1_A0)
#define GPIO_PC15A_TC1_A0        _UL(1 << 15)
#define PIN_PC02D_TC1_A1               _L(66) /**< \brief TC1 signal: A1 on PC02 mux D */
#define MUX_PC02D_TC1_A1                _L(3)
#define PINMUX_PC02D_TC1_A1        ((PIN_PC02D_TC1_A1 << 16) | MUX_PC02D_TC1_A1)
#define GPIO_PC02D_TC1_A1        _UL(1 <<  2)
#define PIN_PC17A_TC1_A1               _L(81) /**< \brief TC1 signal: A1 on PC17 mux A */
#define MUX_PC17A_TC1_A1                _L(0)
#define PINMUX_PC17A_TC1_A1        ((PIN_PC17A_TC1_A1 << 16) | MUX_PC17A_TC1_A1)
#define GPIO_PC17A_TC1_A1        _UL(1 << 17)
#define PIN_PC04D_TC1_A2               _L(68) /**< \brief TC1 signal: A2 on PC04 mux D */
#define MUX_PC04D_TC1_A2                _L(3)
#define PINMUX_PC04D_TC1_A2        ((PIN_PC04D_TC1_A2 << 16) | MUX_PC04D_TC1_A2)
#define GPIO_PC04D_TC1_A2        _UL(1 <<  4)
#define PIN_PC19A_TC1_A2               _L(83) /**< \brief TC1 signal: A2 on PC19 mux A */
#define MUX_PC19A_TC1_A2                _L(0)
#define PINMUX_PC19A_TC1_A2        ((PIN_PC19A_TC1_A2 << 16) | MUX_PC19A_TC1_A2)
#define GPIO_PC19A_TC1_A2        _UL(1 << 19)
#define PIN_PC01D_TC1_B0               _L(65) /**< \brief TC1 signal: B0 on PC01 mux D */
#define MUX_PC01D_TC1_B0                _L(3)
#define PINMUX_PC01D_TC1_B0        ((PIN_PC01D_TC1_B0 << 16) | MUX_PC01D_TC1_B0)
#define GPIO_PC01D_TC1_B0        _UL(1 <<  1)
#define PIN_PC16A_TC1_B0               _L(80) /**< \brief TC1 signal: B0 on PC16 mux A */
#define MUX_PC16A_TC1_B0                _L(0)
#define PINMUX_PC16A_TC1_B0        ((PIN_PC16A_TC1_B0 << 16) | MUX_PC16A_TC1_B0)
#define GPIO_PC16A_TC1_B0        _UL(1 << 16)
#define PIN_PC03D_TC1_B1               _L(67) /**< \brief TC1 signal: B1 on PC03 mux D */
#define MUX_PC03D_TC1_B1                _L(3)
#define PINMUX_PC03D_TC1_B1        ((PIN_PC03D_TC1_B1 << 16) | MUX_PC03D_TC1_B1)
#define GPIO_PC03D_TC1_B1        _UL(1 <<  3)
#define PIN_PC18A_TC1_B1               _L(82) /**< \brief TC1 signal: B1 on PC18 mux A */
#define MUX_PC18A_TC1_B1                _L(0)
#define PINMUX_PC18A_TC1_B1        ((PIN_PC18A_TC1_B1 << 16) | MUX_PC18A_TC1_B1)
#define GPIO_PC18A_TC1_B1        _UL(1 << 18)
#define PIN_PC05D_TC1_B2               _L(69) /**< \brief TC1 signal: B2 on PC05 mux D */
#define MUX_PC05D_TC1_B2                _L(3)
#define PINMUX_PC05D_TC1_B2        ((PIN_PC05D_TC1_B2 << 16) | MUX_PC05D_TC1_B2)
#define GPIO_PC05D_TC1_B2        _UL(1 <<  5)
#define PIN_PC20A_TC1_B2               _L(84) /**< \brief TC1 signal: B2 on PC20 mux A */
#define MUX_PC20A_TC1_B2                _L(0)
#define PINMUX_PC20A_TC1_B2        ((PIN_PC20A_TC1_B2 << 16) | MUX_PC20A_TC1_B2)
#define GPIO_PC20A_TC1_B2        _UL(1 << 20)
#define PIN_PC06D_TC1_CLK0             _L(70) /**< \brief TC1 signal: CLK0 on PC06 mux D */
#define MUX_PC06D_TC1_CLK0              _L(3)
#define PINMUX_PC06D_TC1_CLK0      ((PIN_PC06D_TC1_CLK0 << 16) | MUX_PC06D_TC1_CLK0)
#define GPIO_PC06D_TC1_CLK0      _UL(1 <<  6)
#define PIN_PC21A_TC1_CLK0             _L(85) /**< \brief TC1 signal: CLK0 on PC21 mux A */
#define MUX_PC21A_TC1_CLK0              _L(0)
#define PINMUX_PC21A_TC1_CLK0      ((PIN_PC21A_TC1_CLK0 << 16) | MUX_PC21A_TC1_CLK0)
#define GPIO_PC21A_TC1_CLK0      _UL(1 << 21)
#define PIN_PC07D_TC1_CLK1             _L(71) /**< \brief TC1 signal: CLK1 on PC07 mux D */
#define MUX_PC07D_TC1_CLK1              _L(3)
#define PINMUX_PC07D_TC1_CLK1      ((PIN_PC07D_TC1_CLK1 << 16) | MUX_PC07D_TC1_CLK1)
#define GPIO_PC07D_TC1_CLK1      _UL(1 <<  7)
#define PIN_PC22A_TC1_CLK1             _L(86) /**< \brief TC1 signal: CLK1 on PC22 mux A */
#define MUX_PC22A_TC1_CLK1              _L(0)
#define PINMUX_PC22A_TC1_CLK1      ((PIN_PC22A_TC1_CLK1 << 16) | MUX_PC22A_TC1_CLK1)
#define GPIO_PC22A_TC1_CLK1      _UL(1 << 22)
#define PIN_PC08D_TC1_CLK2             _L(72) /**< \brief TC1 signal: CLK2 on PC08 mux D */
#define MUX_PC08D_TC1_CLK2              _L(3)
#define PINMUX_PC08D_TC1_CLK2      ((PIN_PC08D_TC1_CLK2 << 16) | MUX_PC08D_TC1_CLK2)
#define GPIO_PC08D_TC1_CLK2      _UL(1 <<  8)
#define PIN_PC23A_TC1_CLK2             _L(87) /**< \brief TC1 signal: CLK2 on PC23 mux A */
#define MUX_PC23A_TC1_CLK2              _L(0)
#define PINMUX_PC23A_TC1_CLK2      ((PIN_PC23A_TC1_CLK2 << 16) | MUX_PC23A_TC1_CLK2)
#define GPIO_PC23A_TC1_CLK2      _UL(1 << 23)
/* ========== GPIO definition for USART0 peripheral ========== */
#define PIN_PA04B_USART0_CLK            _L(4) /**< \brief USART0 signal: CLK on PA04 mux B */
#define MUX_PA04B_USART0_CLK            _L(1)
#define PINMUX_PA04B_USART0_CLK    ((PIN_PA04B_USART0_CLK << 16) | MUX_PA04B_USART0_CLK)
#define GPIO_PA04B_USART0_CLK    _UL(1 <<  4)
#define PIN_PC00B_USART0_CLK           _L(64) /**< \brief USART0 signal: CLK on PC00 mux B */
#define MUX_PC00B_USART0_CLK            _L(1)
#define PINMUX_PC00B_USART0_CLK    ((PIN_PC00B_USART0_CLK << 16) | MUX_PC00B_USART0_CLK)
#define GPIO_PC00B_USART0_CLK    _UL(1 <<  0)
#define PIN_PA10A_USART0_CLK           _L(10) /**< \brief USART0 signal: CLK on PA10 mux A */
#define MUX_PA10A_USART0_CLK            _L(0)
#define PINMUX_PA10A_USART0_CLK    ((PIN_PA10A_USART0_CLK << 16) | MUX_PA10A_USART0_CLK)
#define GPIO_PA10A_USART0_CLK    _UL(1 << 10)
#define PIN_PB13A_USART0_CLK           _L(45) /**< \brief USART0 signal: CLK on PB13 mux A */
#define MUX_PB13A_USART0_CLK            _L(0)
#define PINMUX_PB13A_USART0_CLK    ((PIN_PB13A_USART0_CLK << 16) | MUX_PB13A_USART0_CLK)
#define GPIO_PB13A_USART0_CLK    _UL(1 << 13)
#define PIN_PC02B_USART0_CTS           _L(66) /**< \brief USART0 signal: CTS on PC02 mux B */
#define MUX_PC02B_USART0_CTS            _L(1)
#define PINMUX_PC02B_USART0_CTS    ((PIN_PC02B_USART0_CTS << 16) | MUX_PC02B_USART0_CTS)
#define GPIO_PC02B_USART0_CTS    _UL(1 <<  2)
#define PIN_PA09A_USART0_CTS            _L(9) /**< \brief USART0 signal: CTS on PA09 mux A */
#define MUX_PA09A_USART0_CTS            _L(0)
#define PINMUX_PA09A_USART0_CTS    ((PIN_PA09A_USART0_CTS << 16) | MUX_PA09A_USART0_CTS)
#define GPIO_PA09A_USART0_CTS    _UL(1 <<  9)
#define PIN_PB11A_USART0_CTS           _L(43) /**< \brief USART0 signal: CTS on PB11 mux A */
#define MUX_PB11A_USART0_CTS            _L(0)
#define PINMUX_PB11A_USART0_CTS    ((PIN_PB11A_USART0_CTS << 16) | MUX_PB11A_USART0_CTS)
#define GPIO_PB11A_USART0_CTS    _UL(1 << 11)
#define PIN_PA06B_USART0_RTS            _L(6) /**< \brief USART0 signal: RTS on PA06 mux B */
#define MUX_PA06B_USART0_RTS            _L(1)
#define PINMUX_PA06B_USART0_RTS    ((PIN_PA06B_USART0_RTS << 16) | MUX_PA06B_USART0_RTS)
#define GPIO_PA06B_USART0_RTS    _UL(1 <<  6)
#define PIN_PC01B_USART0_RTS           _L(65) /**< \brief USART0 signal: RTS on PC01 mux B */
#define MUX_PC01B_USART0_RTS            _L(1)
#define PINMUX_PC01B_USART0_RTS    ((PIN_PC01B_USART0_RTS << 16) | MUX_PC01B_USART0_RTS)
#define GPIO_PC01B_USART0_RTS    _UL(1 <<  1)
#define PIN_PA08A_USART0_RTS            _L(8) /**< \brief USART0 signal: RTS on PA08 mux A */
#define MUX_PA08A_USART0_RTS            _L(0)
#define PINMUX_PA08A_USART0_RTS    ((PIN_PA08A_USART0_RTS << 16) | MUX_PA08A_USART0_RTS)
#define GPIO_PA08A_USART0_RTS    _UL(1 <<  8)
#define PIN_PB12A_USART0_RTS           _L(44) /**< \brief USART0 signal: RTS on PB12 mux A */
#define MUX_PB12A_USART0_RTS            _L(0)
#define PINMUX_PB12A_USART0_RTS    ((PIN_PB12A_USART0_RTS << 16) | MUX_PB12A_USART0_RTS)
#define GPIO_PB12A_USART0_RTS    _UL(1 << 12)
#define PIN_PC02C_USART0_RXD           _L(66) /**< \brief USART0 signal: RXD on PC02 mux C */
#define MUX_PC02C_USART0_RXD            _L(2)
#define PINMUX_PC02C_USART0_RXD    ((PIN_PC02C_USART0_RXD << 16) | MUX_PC02C_USART0_RXD)
#define GPIO_PC02C_USART0_RXD    _UL(1 <<  2)
#define PIN_PA05B_USART0_RXD            _L(5) /**< \brief USART0 signal: RXD on PA05 mux B */
#define MUX_PA05B_USART0_RXD            _L(1)
#define PINMUX_PA05B_USART0_RXD    ((PIN_PA05B_USART0_RXD << 16) | MUX_PA05B_USART0_RXD)
#define GPIO_PA05B_USART0_RXD    _UL(1 <<  5)
#define PIN_PB00B_USART0_RXD           _L(32) /**< \brief USART0 signal: RXD on PB00 mux B */
#define MUX_PB00B_USART0_RXD            _L(1)
#define PINMUX_PB00B_USART0_RXD    ((PIN_PB00B_USART0_RXD << 16) | MUX_PB00B_USART0_RXD)
#define GPIO_PB00B_USART0_RXD    _UL(1 <<  0)
#define PIN_PA11A_USART0_RXD           _L(11) /**< \brief USART0 signal: RXD on PA11 mux A */
#define MUX_PA11A_USART0_RXD            _L(0)
#define PINMUX_PA11A_USART0_RXD    ((PIN_PA11A_USART0_RXD << 16) | MUX_PA11A_USART0_RXD)
#define GPIO_PA11A_USART0_RXD    _UL(1 << 11)
#define PIN_PB14A_USART0_RXD           _L(46) /**< \brief USART0 signal: RXD on PB14 mux A */
#define MUX_PB14A_USART0_RXD            _L(0)
#define PINMUX_PB14A_USART0_RXD    ((PIN_PB14A_USART0_RXD << 16) | MUX_PB14A_USART0_RXD)
#define GPIO_PB14A_USART0_RXD    _UL(1 << 14)
#define PIN_PC03C_USART0_TXD           _L(67) /**< \brief USART0 signal: TXD on PC03 mux C */
#define MUX_PC03C_USART0_TXD            _L(2)
#define PINMUX_PC03C_USART0_TXD    ((PIN_PC03C_USART0_TXD << 16) | MUX_PC03C_USART0_TXD)
#define GPIO_PC03C_USART0_TXD    _UL(1 <<  3)
#define PIN_PA07B_USART0_TXD            _L(7) /**< \brief USART0 signal: TXD on PA07 mux B */
#define MUX_PA07B_USART0_TXD            _L(1)
#define PINMUX_PA07B_USART0_TXD    ((PIN_PA07B_USART0_TXD << 16) | MUX_PA07B_USART0_TXD)
#define GPIO_PA07B_USART0_TXD    _UL(1 <<  7)
#define PIN_PB01B_USART0_TXD           _L(33) /**< \brief USART0 signal: TXD on PB01 mux B */
#define MUX_PB01B_USART0_TXD            _L(1)
#define PINMUX_PB01B_USART0_TXD    ((PIN_PB01B_USART0_TXD << 16) | MUX_PB01B_USART0_TXD)
#define GPIO_PB01B_USART0_TXD    _UL(1 <<  1)
#define PIN_PA12A_USART0_TXD           _L(12) /**< \brief USART0 signal: TXD on PA12 mux A */
#define MUX_PA12A_USART0_TXD            _L(0)
#define PINMUX_PA12A_USART0_TXD    ((PIN_PA12A_USART0_TXD << 16) | MUX_PA12A_USART0_TXD)
#define GPIO_PA12A_USART0_TXD    _UL(1 << 12)
#define PIN_PB15A_USART0_TXD           _L(47) /**< \brief USART0 signal: TXD on PB15 mux A */
#define MUX_PB15A_USART0_TXD            _L(0)
#define PINMUX_PB15A_USART0_TXD    ((PIN_PB15A_USART0_TXD << 16) | MUX_PB15A_USART0_TXD)
#define GPIO_PB15A_USART0_TXD    _UL(1 << 15)
/* ========== GPIO definition for USART1 peripheral ========== */
#define PIN_PB03B_USART1_CLK           _L(35) /**< \brief USART1 signal: CLK on PB03 mux B */
#define MUX_PB03B_USART1_CLK            _L(1)
#define PINMUX_PB03B_USART1_CLK    ((PIN_PB03B_USART1_CLK << 16) | MUX_PB03B_USART1_CLK)
#define GPIO_PB03B_USART1_CLK    _UL(1 <<  3)
#define PIN_PA14A_USART1_CLK           _L(14) /**< \brief USART1 signal: CLK on PA14 mux A */
#define MUX_PA14A_USART1_CLK            _L(0)
#define PINMUX_PA14A_USART1_CLK    ((PIN_PA14A_USART1_CLK << 16) | MUX_PA14A_USART1_CLK)
#define GPIO_PA14A_USART1_CLK    _UL(1 << 14)
#define PIN_PC25A_USART1_CLK           _L(89) /**< \brief USART1 signal: CLK on PC25 mux A */
#define MUX_PC25A_USART1_CLK            _L(0)
#define PINMUX_PC25A_USART1_CLK    ((PIN_PC25A_USART1_CLK << 16) | MUX_PC25A_USART1_CLK)
#define GPIO_PC25A_USART1_CLK    _UL(1 << 25)
#define PIN_PA21B_USART1_CTS           _L(21) /**< \brief USART1 signal: CTS on PA21 mux B */
#define MUX_PA21B_USART1_CTS            _L(1)
#define PINMUX_PA21B_USART1_CTS    ((PIN_PA21B_USART1_CTS << 16) | MUX_PA21B_USART1_CTS)
#define GPIO_PA21B_USART1_CTS    _UL(1 << 21)
#define PIN_PB02B_USART1_RTS           _L(34) /**< \brief USART1 signal: RTS on PB02 mux B */
#define MUX_PB02B_USART1_RTS            _L(1)
#define PINMUX_PB02B_USART1_RTS    ((PIN_PB02B_USART1_RTS << 16) | MUX_PB02B_USART1_RTS)
#define GPIO_PB02B_USART1_RTS    _UL(1 <<  2)
#define PIN_PA13A_USART1_RTS           _L(13) /**< \brief USART1 signal: RTS on PA13 mux A */
#define MUX_PA13A_USART1_RTS            _L(0)
#define PINMUX_PA13A_USART1_RTS    ((PIN_PA13A_USART1_RTS << 16) | MUX_PA13A_USART1_RTS)
#define GPIO_PA13A_USART1_RTS    _UL(1 << 13)
#define PIN_PC24A_USART1_RTS           _L(88) /**< \brief USART1 signal: RTS on PC24 mux A */
#define MUX_PC24A_USART1_RTS            _L(0)
#define PINMUX_PC24A_USART1_RTS    ((PIN_PC24A_USART1_RTS << 16) | MUX_PC24A_USART1_RTS)
#define GPIO_PC24A_USART1_RTS    _UL(1 << 24)
#define PIN_PB04B_USART1_RXD           _L(36) /**< \brief USART1 signal: RXD on PB04 mux B */
#define MUX_PB04B_USART1_RXD            _L(1)
#define PINMUX_PB04B_USART1_RXD    ((PIN_PB04B_USART1_RXD << 16) | MUX_PB04B_USART1_RXD)
#define GPIO_PB04B_USART1_RXD    _UL(1 <<  4)
#define PIN_PA15A_USART1_RXD           _L(15) /**< \brief USART1 signal: RXD on PA15 mux A */
#define MUX_PA15A_USART1_RXD            _L(0)
#define PINMUX_PA15A_USART1_RXD    ((PIN_PA15A_USART1_RXD << 16) | MUX_PA15A_USART1_RXD)
#define GPIO_PA15A_USART1_RXD    _UL(1 << 15)
#define PIN_PC26A_USART1_RXD           _L(90) /**< \brief USART1 signal: RXD on PC26 mux A */
#define MUX_PC26A_USART1_RXD            _L(0)
#define PINMUX_PC26A_USART1_RXD    ((PIN_PC26A_USART1_RXD << 16) | MUX_PC26A_USART1_RXD)
#define GPIO_PC26A_USART1_RXD    _UL(1 << 26)
#define PIN_PB05B_USART1_TXD           _L(37) /**< \brief USART1 signal: TXD on PB05 mux B */
#define MUX_PB05B_USART1_TXD            _L(1)
#define PINMUX_PB05B_USART1_TXD    ((PIN_PB05B_USART1_TXD << 16) | MUX_PB05B_USART1_TXD)
#define GPIO_PB05B_USART1_TXD    _UL(1 <<  5)
#define PIN_PA16A_USART1_TXD           _L(16) /**< \brief USART1 signal: TXD on PA16 mux A */
#define MUX_PA16A_USART1_TXD            _L(0)
#define PINMUX_PA16A_USART1_TXD    ((PIN_PA16A_USART1_TXD << 16) | MUX_PA16A_USART1_TXD)
#define GPIO_PA16A_USART1_TXD    _UL(1 << 16)
#define PIN_PC27A_USART1_TXD           _L(91) /**< \brief USART1 signal: TXD on PC27 mux A */
#define MUX_PC27A_USART1_TXD            _L(0)
#define PINMUX_PC27A_USART1_TXD    ((PIN_PC27A_USART1_TXD << 16) | MUX_PC27A_USART1_TXD)
#define GPIO_PC27A_USART1_TXD    _UL(1 << 27)
/* ========== GPIO definition for USART2 peripheral ========== */
#define PIN_PC08B_USART2_CLK           _L(72) /**< \brief USART2 signal: CLK on PC08 mux B */
#define MUX_PC08B_USART2_CLK            _L(1)
#define PINMUX_PC08B_USART2_CLK    ((PIN_PC08B_USART2_CLK << 16) | MUX_PC08B_USART2_CLK)
#define GPIO_PC08B_USART2_CLK    _UL(1 <<  8)
#define PIN_PA18A_USART2_CLK           _L(18) /**< \brief USART2 signal: CLK on PA18 mux A */
#define MUX_PA18A_USART2_CLK            _L(0)
#define PINMUX_PA18A_USART2_CLK    ((PIN_PA18A_USART2_CLK << 16) | MUX_PA18A_USART2_CLK)
#define GPIO_PA18A_USART2_CLK    _UL(1 << 18)
#define PIN_PC08E_USART2_CTS           _L(72) /**< \brief USART2 signal: CTS on PC08 mux E */
#define MUX_PC08E_USART2_CTS            _L(4)
#define PINMUX_PC08E_USART2_CTS    ((PIN_PC08E_USART2_CTS << 16) | MUX_PC08E_USART2_CTS)
#define GPIO_PC08E_USART2_CTS    _UL(1 <<  8)
#define PIN_PA22B_USART2_CTS           _L(22) /**< \brief USART2 signal: CTS on PA22 mux B */
#define MUX_PA22B_USART2_CTS            _L(1)
#define PINMUX_PA22B_USART2_CTS    ((PIN_PA22B_USART2_CTS << 16) | MUX_PA22B_USART2_CTS)
#define GPIO_PA22B_USART2_CTS    _UL(1 << 22)
#define PIN_PC07B_USART2_RTS           _L(71) /**< \brief USART2 signal: RTS on PC07 mux B */
#define MUX_PC07B_USART2_RTS            _L(1)
#define PINMUX_PC07B_USART2_RTS    ((PIN_PC07B_USART2_RTS << 16) | MUX_PC07B_USART2_RTS)
#define GPIO_PC07B_USART2_RTS    _UL(1 <<  7)
#define PIN_PA17A_USART2_RTS           _L(17) /**< \brief USART2 signal: RTS on PA17 mux A */
#define MUX_PA17A_USART2_RTS            _L(0)
#define PINMUX_PA17A_USART2_RTS    ((PIN_PA17A_USART2_RTS << 16) | MUX_PA17A_USART2_RTS)
#define GPIO_PA17A_USART2_RTS    _UL(1 << 17)
#define PIN_PA25B_USART2_RXD           _L(25) /**< \brief USART2 signal: RXD on PA25 mux B */
#define MUX_PA25B_USART2_RXD            _L(1)
#define PINMUX_PA25B_USART2_RXD    ((PIN_PA25B_USART2_RXD << 16) | MUX_PA25B_USART2_RXD)
#define GPIO_PA25B_USART2_RXD    _UL(1 << 25)
#define PIN_PC11B_USART2_RXD           _L(75) /**< \brief USART2 signal: RXD on PC11 mux B */
#define MUX_PC11B_USART2_RXD            _L(1)
#define PINMUX_PC11B_USART2_RXD    ((PIN_PC11B_USART2_RXD << 16) | MUX_PC11B_USART2_RXD)
#define GPIO_PC11B_USART2_RXD    _UL(1 << 11)
#define PIN_PA19A_USART2_RXD           _L(19) /**< \brief USART2 signal: RXD on PA19 mux A */
#define MUX_PA19A_USART2_RXD            _L(0)
#define PINMUX_PA19A_USART2_RXD    ((PIN_PA19A_USART2_RXD << 16) | MUX_PA19A_USART2_RXD)
#define GPIO_PA19A_USART2_RXD    _UL(1 << 19)
#define PIN_PA26B_USART2_TXD           _L(26) /**< \brief USART2 signal: TXD on PA26 mux B */
#define MUX_PA26B_USART2_TXD            _L(1)
#define PINMUX_PA26B_USART2_TXD    ((PIN_PA26B_USART2_TXD << 16) | MUX_PA26B_USART2_TXD)
#define GPIO_PA26B_USART2_TXD    _UL(1 << 26)
#define PIN_PC12B_USART2_TXD           _L(76) /**< \brief USART2 signal: TXD on PC12 mux B */
#define MUX_PC12B_USART2_TXD            _L(1)
#define PINMUX_PC12B_USART2_TXD    ((PIN_PC12B_USART2_TXD << 16) | MUX_PC12B_USART2_TXD)
#define GPIO_PC12B_USART2_TXD    _UL(1 << 12)
#define PIN_PA20A_USART2_TXD           _L(20) /**< \brief USART2 signal: TXD on PA20 mux A */
#define MUX_PA20A_USART2_TXD            _L(0)
#define PINMUX_PA20A_USART2_TXD    ((PIN_PA20A_USART2_TXD << 16) | MUX_PA20A_USART2_TXD)
#define GPIO_PA20A_USART2_TXD    _UL(1 << 20)
/* ========== GPIO definition for USART3 peripheral ========== */
#define PIN_PC14B_USART3_CLK           _L(78) /**< \brief USART3 signal: CLK on PC14 mux B */
#define MUX_PC14B_USART3_CLK            _L(1)
#define PINMUX_PC14B_USART3_CLK    ((PIN_PC14B_USART3_CLK << 16) | MUX_PC14B_USART3_CLK)
#define GPIO_PC14B_USART3_CLK    _UL(1 << 14)
