zephyrproject-rtos/hal_atmel/asf/sam/include/sam4l/pio/sam4lc2c.h
#define PIN_PA10F_LCDCA_COM2           _L(10) /**< \brief LCDCA signal: COM2 on PA10 mux F */
#define MUX_PA10F_LCDCA_COM2            _L(5)
#define PINMUX_PA10F_LCDCA_COM2    ((PIN_PA10F_LCDCA_COM2 << 16) | MUX_PA10F_LCDCA_COM2)
#define GPIO_PA10F_LCDCA_COM2    _UL(1 << 10)
#define PIN_PA09F_LCDCA_COM3            _L(9) /**< \brief LCDCA signal: COM3 on PA09 mux F */
#define MUX_PA09F_LCDCA_COM3            _L(5)
#define PINMUX_PA09F_LCDCA_COM3    ((PIN_PA09F_LCDCA_COM3 << 16) | MUX_PA09F_LCDCA_COM3)
#define GPIO_PA09F_LCDCA_COM3    _UL(1 <<  9)
#define PIN_PC15F_LCDCA_SEG0           _L(79) /**< \brief LCDCA signal: SEG0 on PC15 mux F */
#define MUX_PC15F_LCDCA_SEG0            _L(5)
#define PINMUX_PC15F_LCDCA_SEG0    ((PIN_PC15F_LCDCA_SEG0 << 16) | MUX_PC15F_LCDCA_SEG0)
#define GPIO_PC15F_LCDCA_SEG0    _UL(1 << 15)
#define PIN_PC16F_LCDCA_SEG1           _L(80) /**< \brief LCDCA signal: SEG1 on PC16 mux F */
#define MUX_PC16F_LCDCA_SEG1            _L(5)
#define PINMUX_PC16F_LCDCA_SEG1    ((PIN_PC16F_LCDCA_SEG1 << 16) | MUX_PC16F_LCDCA_SEG1)
#define GPIO_PC16F_LCDCA_SEG1    _UL(1 << 16)
#define PIN_PC17F_LCDCA_SEG2           _L(81) /**< \brief LCDCA signal: SEG2 on PC17 mux F */
#define MUX_PC17F_LCDCA_SEG2            _L(5)
#define PINMUX_PC17F_LCDCA_SEG2    ((PIN_PC17F_LCDCA_SEG2 << 16) | MUX_PC17F_LCDCA_SEG2)
#define GPIO_PC17F_LCDCA_SEG2    _UL(1 << 17)
#define PIN_PC18F_LCDCA_SEG3           _L(82) /**< \brief LCDCA signal: SEG3 on PC18 mux F */
#define MUX_PC18F_LCDCA_SEG3            _L(5)
#define PINMUX_PC18F_LCDCA_SEG3    ((PIN_PC18F_LCDCA_SEG3 << 16) | MUX_PC18F_LCDCA_SEG3)
#define GPIO_PC18F_LCDCA_SEG3    _UL(1 << 18)
#define PIN_PC19F_LCDCA_SEG4           _L(83) /**< \brief LCDCA signal: SEG4 on PC19 mux F */
#define MUX_PC19F_LCDCA_SEG4            _L(5)
#define PINMUX_PC19F_LCDCA_SEG4    ((PIN_PC19F_LCDCA_SEG4 << 16) | MUX_PC19F_LCDCA_SEG4)
#define GPIO_PC19F_LCDCA_SEG4    _UL(1 << 19)
#define PIN_PA13F_LCDCA_SEG5           _L(13) /**< \brief LCDCA signal: SEG5 on PA13 mux F */
#define MUX_PA13F_LCDCA_SEG5            _L(5)
#define PINMUX_PA13F_LCDCA_SEG5    ((PIN_PA13F_LCDCA_SEG5 << 16) | MUX_PA13F_LCDCA_SEG5)
#define GPIO_PA13F_LCDCA_SEG5    _UL(1 << 13)
#define PIN_PA14F_LCDCA_SEG6           _L(14) /**< \brief LCDCA signal: SEG6 on PA14 mux F */
#define MUX_PA14F_LCDCA_SEG6            _L(5)
#define PINMUX_PA14F_LCDCA_SEG6    ((PIN_PA14F_LCDCA_SEG6 << 16) | MUX_PA14F_LCDCA_SEG6)
#define GPIO_PA14F_LCDCA_SEG6    _UL(1 << 14)
#define PIN_PA15F_LCDCA_SEG7           _L(15) /**< \brief LCDCA signal: SEG7 on PA15 mux F */
#define MUX_PA15F_LCDCA_SEG7            _L(5)
#define PINMUX_PA15F_LCDCA_SEG7    ((PIN_PA15F_LCDCA_SEG7 << 16) | MUX_PA15F_LCDCA_SEG7)
#define GPIO_PA15F_LCDCA_SEG7    _UL(1 << 15)
#define PIN_PA16F_LCDCA_SEG8           _L(16) /**< \brief LCDCA signal: SEG8 on PA16 mux F */
#define MUX_PA16F_LCDCA_SEG8            _L(5)
#define PINMUX_PA16F_LCDCA_SEG8    ((PIN_PA16F_LCDCA_SEG8 << 16) | MUX_PA16F_LCDCA_SEG8)
#define GPIO_PA16F_LCDCA_SEG8    _UL(1 << 16)
#define PIN_PA17F_LCDCA_SEG9           _L(17) /**< \brief LCDCA signal: SEG9 on PA17 mux F */
#define MUX_PA17F_LCDCA_SEG9            _L(5)
#define PINMUX_PA17F_LCDCA_SEG9    ((PIN_PA17F_LCDCA_SEG9 << 16) | MUX_PA17F_LCDCA_SEG9)
#define GPIO_PA17F_LCDCA_SEG9    _UL(1 << 17)
#define PIN_PC20F_LCDCA_SEG10          _L(84) /**< \brief LCDCA signal: SEG10 on PC20 mux F */
#define MUX_PC20F_LCDCA_SEG10           _L(5)
#define PINMUX_PC20F_LCDCA_SEG10   ((PIN_PC20F_LCDCA_SEG10 << 16) | MUX_PC20F_LCDCA_SEG10)
#define GPIO_PC20F_LCDCA_SEG10   _UL(1 << 20)
#define PIN_PC21F_LCDCA_SEG11          _L(85) /**< \brief LCDCA signal: SEG11 on PC21 mux F */
#define MUX_PC21F_LCDCA_SEG11           _L(5)
#define PINMUX_PC21F_LCDCA_SEG11   ((PIN_PC21F_LCDCA_SEG11 << 16) | MUX_PC21F_LCDCA_SEG11)
#define GPIO_PC21F_LCDCA_SEG11   _UL(1 << 21)
#define PIN_PC22F_LCDCA_SEG12          _L(86) /**< \brief LCDCA signal: SEG12 on PC22 mux F */
#define MUX_PC22F_LCDCA_SEG12           _L(5)
#define PINMUX_PC22F_LCDCA_SEG12   ((PIN_PC22F_LCDCA_SEG12 << 16) | MUX_PC22F_LCDCA_SEG12)
#define GPIO_PC22F_LCDCA_SEG12   _UL(1 << 22)
#define PIN_PC23F_LCDCA_SEG13          _L(87) /**< \brief LCDCA signal: SEG13 on PC23 mux F */
#define MUX_PC23F_LCDCA_SEG13           _L(5)
#define PINMUX_PC23F_LCDCA_SEG13   ((PIN_PC23F_LCDCA_SEG13 << 16) | MUX_PC23F_LCDCA_SEG13)
#define GPIO_PC23F_LCDCA_SEG13   _UL(1 << 23)
#define PIN_PB08F_LCDCA_SEG14          _L(40) /**< \brief LCDCA signal: SEG14 on PB08 mux F */
#define MUX_PB08F_LCDCA_SEG14           _L(5)
#define PINMUX_PB08F_LCDCA_SEG14   ((PIN_PB08F_LCDCA_SEG14 << 16) | MUX_PB08F_LCDCA_SEG14)
#define GPIO_PB08F_LCDCA_SEG14   _UL(1 <<  8)
#define PIN_PB09F_LCDCA_SEG15          _L(41) /**< \brief LCDCA signal: SEG15 on PB09 mux F */
#define MUX_PB09F_LCDCA_SEG15           _L(5)
#define PINMUX_PB09F_LCDCA_SEG15   ((PIN_PB09F_LCDCA_SEG15 << 16) | MUX_PB09F_LCDCA_SEG15)
#define GPIO_PB09F_LCDCA_SEG15   _UL(1 <<  9)
#define PIN_PB10F_LCDCA_SEG16          _L(42) /**< \brief LCDCA signal: SEG16 on PB10 mux F */
#define MUX_PB10F_LCDCA_SEG16           _L(5)
#define PINMUX_PB10F_LCDCA_SEG16   ((PIN_PB10F_LCDCA_SEG16 << 16) | MUX_PB10F_LCDCA_SEG16)
#define GPIO_PB10F_LCDCA_SEG16   _UL(1 << 10)
#define PIN_PB11F_LCDCA_SEG17          _L(43) /**< \brief LCDCA signal: SEG17 on PB11 mux F */
#define MUX_PB11F_LCDCA_SEG17           _L(5)
#define PINMUX_PB11F_LCDCA_SEG17   ((PIN_PB11F_LCDCA_SEG17 << 16) | MUX_PB11F_LCDCA_SEG17)
#define GPIO_PB11F_LCDCA_SEG17   _UL(1 << 11)
#define PIN_PA18F_LCDCA_SEG18          _L(18) /**< \brief LCDCA signal: SEG18 on PA18 mux F */
#define MUX_PA18F_LCDCA_SEG18           _L(5)
#define PINMUX_PA18F_LCDCA_SEG18   ((PIN_PA18F_LCDCA_SEG18 << 16) | MUX_PA18F_LCDCA_SEG18)
#define GPIO_PA18F_LCDCA_SEG18   _UL(1 << 18)
#define PIN_PA19F_LCDCA_SEG19          _L(19) /**< \brief LCDCA signal: SEG19 on PA19 mux F */
#define MUX_PA19F_LCDCA_SEG19           _L(5)
#define PINMUX_PA19F_LCDCA_SEG19   ((PIN_PA19F_LCDCA_SEG19 << 16) | MUX_PA19F_LCDCA_SEG19)
#define GPIO_PA19F_LCDCA_SEG19   _UL(1 << 19)
#define PIN_PA20F_LCDCA_SEG20          _L(20) /**< \brief LCDCA signal: SEG20 on PA20 mux F */
#define MUX_PA20F_LCDCA_SEG20           _L(5)
#define PINMUX_PA20F_LCDCA_SEG20   ((PIN_PA20F_LCDCA_SEG20 << 16) | MUX_PA20F_LCDCA_SEG20)
#define GPIO_PA20F_LCDCA_SEG20   _UL(1 << 20)
#define PIN_PB07F_LCDCA_SEG21          _L(39) /**< \brief LCDCA signal: SEG21 on PB07 mux F */
#define MUX_PB07F_LCDCA_SEG21           _L(5)
#define PINMUX_PB07F_LCDCA_SEG21   ((PIN_PB07F_LCDCA_SEG21 << 16) | MUX_PB07F_LCDCA_SEG21)
#define GPIO_PB07F_LCDCA_SEG21   _UL(1 <<  7)
#define PIN_PB06F_LCDCA_SEG22          _L(38) /**< \brief LCDCA signal: SEG22 on PB06 mux F */
#define MUX_PB06F_LCDCA_SEG22           _L(5)
#define PINMUX_PB06F_LCDCA_SEG22   ((PIN_PB06F_LCDCA_SEG22 << 16) | MUX_PB06F_LCDCA_SEG22)
#define GPIO_PB06F_LCDCA_SEG22   _UL(1 <<  6)
#define PIN_PA08F_LCDCA_SEG23           _L(8) /**< \brief LCDCA signal: SEG23 on PA08 mux F */
#define MUX_PA08F_LCDCA_SEG23           _L(5)
#define PINMUX_PA08F_LCDCA_SEG23   ((PIN_PA08F_LCDCA_SEG23 << 16) | MUX_PA08F_LCDCA_SEG23)
#define GPIO_PA08F_LCDCA_SEG23   _UL(1 <<  8)
#define PIN_PC24F_LCDCA_SEG24          _L(88) /**< \brief LCDCA signal: SEG24 on PC24 mux F */
#define MUX_PC24F_LCDCA_SEG24           _L(5)
#define PINMUX_PC24F_LCDCA_SEG24   ((PIN_PC24F_LCDCA_SEG24 << 16) | MUX_PC24F_LCDCA_SEG24)
#define GPIO_PC24F_LCDCA_SEG24   _UL(1 << 24)
#define PIN_PC25F_LCDCA_SEG25          _L(89) /**< \brief LCDCA signal: SEG25 on PC25 mux F */
#define MUX_PC25F_LCDCA_SEG25           _L(5)
#define PINMUX_PC25F_LCDCA_SEG25   ((PIN_PC25F_LCDCA_SEG25 << 16) | MUX_PC25F_LCDCA_SEG25)
#define GPIO_PC25F_LCDCA_SEG25   _UL(1 << 25)
#define PIN_PC26F_LCDCA_SEG26          _L(90) /**< \brief LCDCA signal: SEG26 on PC26 mux F */
#define MUX_PC26F_LCDCA_SEG26           _L(5)
#define PINMUX_PC26F_LCDCA_SEG26   ((PIN_PC26F_LCDCA_SEG26 << 16) | MUX_PC26F_LCDCA_SEG26)
#define GPIO_PC26F_LCDCA_SEG26   _UL(1 << 26)
#define PIN_PC27F_LCDCA_SEG27          _L(91) /**< \brief LCDCA signal: SEG27 on PC27 mux F */
#define MUX_PC27F_LCDCA_SEG27           _L(5)
#define PINMUX_PC27F_LCDCA_SEG27   ((PIN_PC27F_LCDCA_SEG27 << 16) | MUX_PC27F_LCDCA_SEG27)
#define GPIO_PC27F_LCDCA_SEG27   _UL(1 << 27)
#define PIN_PC28F_LCDCA_SEG28          _L(92) /**< \brief LCDCA signal: SEG28 on PC28 mux F */
#define MUX_PC28F_LCDCA_SEG28           _L(5)
#define PINMUX_PC28F_LCDCA_SEG28   ((PIN_PC28F_LCDCA_SEG28 << 16) | MUX_PC28F_LCDCA_SEG28)
#define GPIO_PC28F_LCDCA_SEG28   _UL(1 << 28)
#define PIN_PC29F_LCDCA_SEG29          _L(93) /**< \brief LCDCA signal: SEG29 on PC29 mux F */
#define MUX_PC29F_LCDCA_SEG29           _L(5)
#define PINMUX_PC29F_LCDCA_SEG29   ((PIN_PC29F_LCDCA_SEG29 << 16) | MUX_PC29F_LCDCA_SEG29)
#define GPIO_PC29F_LCDCA_SEG29   _UL(1 << 29)
#define PIN_PC30F_LCDCA_SEG30          _L(94) /**< \brief LCDCA signal: SEG30 on PC30 mux F */
#define MUX_PC30F_LCDCA_SEG30           _L(5)
#define PINMUX_PC30F_LCDCA_SEG30   ((PIN_PC30F_LCDCA_SEG30 << 16) | MUX_PC30F_LCDCA_SEG30)
#define GPIO_PC30F_LCDCA_SEG30   _UL(1 << 30)
#define PIN_PC31F_LCDCA_SEG31          _L(95) /**< \brief LCDCA signal: SEG31 on PC31 mux F */
#define MUX_PC31F_LCDCA_SEG31           _L(5)
#define PINMUX_PC31F_LCDCA_SEG31   ((PIN_PC31F_LCDCA_SEG31 << 16) | MUX_PC31F_LCDCA_SEG31)
#define GPIO_PC31F_LCDCA_SEG31   _UL(1 << 31)
#define PIN_PB12F_LCDCA_SEG32          _L(44) /**< \brief LCDCA signal: SEG32 on PB12 mux F */
#define MUX_PB12F_LCDCA_SEG32           _L(5)
#define PINMUX_PB12F_LCDCA_SEG32   ((PIN_PB12F_LCDCA_SEG32 << 16) | MUX_PB12F_LCDCA_SEG32)
#define GPIO_PB12F_LCDCA_SEG32   _UL(1 << 12)
#define PIN_PB13F_LCDCA_SEG33          _L(45) /**< \brief LCDCA signal: SEG33 on PB13 mux F */
#define MUX_PB13F_LCDCA_SEG33           _L(5)
#define PINMUX_PB13F_LCDCA_SEG33   ((PIN_PB13F_LCDCA_SEG33 << 16) | MUX_PB13F_LCDCA_SEG33)
#define GPIO_PB13F_LCDCA_SEG33   _UL(1 << 13)
#define PIN_PA21F_LCDCA_SEG34          _L(21) /**< \brief LCDCA signal: SEG34 on PA21 mux F */
#define MUX_PA21F_LCDCA_SEG34           _L(5)
#define PINMUX_PA21F_LCDCA_SEG34   ((PIN_PA21F_LCDCA_SEG34 << 16) | MUX_PA21F_LCDCA_SEG34)
#define GPIO_PA21F_LCDCA_SEG34   _UL(1 << 21)
#define PIN_PA22F_LCDCA_SEG35          _L(22) /**< \brief LCDCA signal: SEG35 on PA22 mux F */
#define MUX_PA22F_LCDCA_SEG35           _L(5)
#define PINMUX_PA22F_LCDCA_SEG35   ((PIN_PA22F_LCDCA_SEG35 << 16) | MUX_PA22F_LCDCA_SEG35)
#define GPIO_PA22F_LCDCA_SEG35   _UL(1 << 22)
#define PIN_PB14F_LCDCA_SEG36          _L(46) /**< \brief LCDCA signal: SEG36 on PB14 mux F */
#define MUX_PB14F_LCDCA_SEG36           _L(5)
#define PINMUX_PB14F_LCDCA_SEG36   ((PIN_PB14F_LCDCA_SEG36 << 16) | MUX_PB14F_LCDCA_SEG36)
#define GPIO_PB14F_LCDCA_SEG36   _UL(1 << 14)
#define PIN_PB15F_LCDCA_SEG37          _L(47) /**< \brief LCDCA signal: SEG37 on PB15 mux F */
#define MUX_PB15F_LCDCA_SEG37           _L(5)
#define PINMUX_PB15F_LCDCA_SEG37   ((PIN_PB15F_LCDCA_SEG37 << 16) | MUX_PB15F_LCDCA_SEG37)
#define GPIO_PB15F_LCDCA_SEG37   _UL(1 << 15)
#define PIN_PA23F_LCDCA_SEG38          _L(23) /**< \brief LCDCA signal: SEG38 on PA23 mux F */
#define MUX_PA23F_LCDCA_SEG38           _L(5)
#define PINMUX_PA23F_LCDCA_SEG38   ((PIN_PA23F_LCDCA_SEG38 << 16) | MUX_PA23F_LCDCA_SEG38)
#define GPIO_PA23F_LCDCA_SEG38   _UL(1 << 23)
#define PIN_PA24F_LCDCA_SEG39          _L(24) /**< \brief LCDCA signal: SEG39 on PA24 mux F */
#define MUX_PA24F_LCDCA_SEG39           _L(5)
#define PINMUX_PA24F_LCDCA_SEG39   ((PIN_PA24F_LCDCA_SEG39 << 16) | MUX_PA24F_LCDCA_SEG39)
#define GPIO_PA24F_LCDCA_SEG39   _UL(1 << 24)
/* ========== GPIO definition for USBC peripheral ========== */
#define PIN_PA25A_USBC_DM              _L(25) /**< \brief USBC signal: DM on PA25 mux A */
#define MUX_PA25A_USBC_DM               _L(0)
#define PINMUX_PA25A_USBC_DM       ((PIN_PA25A_USBC_DM << 16) | MUX_PA25A_USBC_DM)
#define GPIO_PA25A_USBC_DM       _UL(1 << 25)
#define PIN_PA26A_USBC_DP              _L(26) /**< \brief USBC signal: DP on PA26 mux A */
#define MUX_PA26A_USBC_DP               _L(0)
#define PINMUX_PA26A_USBC_DP       ((PIN_PA26A_USBC_DP << 16) | MUX_PA26A_USBC_DP)
#define GPIO_PA26A_USBC_DP       _UL(1 << 26)
/* ========== GPIO definition for PEVC peripheral ========== */
#define PIN_PA08C_PEVC_PAD_EVT0         _L(8) /**< \brief PEVC signal: PAD_EVT0 on PA08 mux C */
#define MUX_PA08C_PEVC_PAD_EVT0         _L(2)
#define PINMUX_PA08C_PEVC_PAD_EVT0  ((PIN_PA08C_PEVC_PAD_EVT0 << 16) | MUX_PA08C_PEVC_PAD_EVT0)
#define GPIO_PA08C_PEVC_PAD_EVT0  _UL(1 <<  8)
#define PIN_PB12C_PEVC_PAD_EVT0        _L(44) /**< \brief PEVC signal: PAD_EVT0 on PB12 mux C */
#define MUX_PB12C_PEVC_PAD_EVT0         _L(2)
#define PINMUX_PB12C_PEVC_PAD_EVT0  ((PIN_PB12C_PEVC_PAD_EVT0 << 16) | MUX_PB12C_PEVC_PAD_EVT0)
#define GPIO_PB12C_PEVC_PAD_EVT0  _UL(1 << 12)
#define PIN_PC07C_PEVC_PAD_EVT0        _L(71) /**< \brief PEVC signal: PAD_EVT0 on PC07 mux C */
#define MUX_PC07C_PEVC_PAD_EVT0         _L(2)
#define PINMUX_PC07C_PEVC_PAD_EVT0  ((PIN_PC07C_PEVC_PAD_EVT0 << 16) | MUX_PC07C_PEVC_PAD_EVT0)
#define GPIO_PC07C_PEVC_PAD_EVT0  _UL(1 <<  7)
#define PIN_PC24C_PEVC_PAD_EVT0        _L(88) /**< \brief PEVC signal: PAD_EVT0 on PC24 mux C */
#define MUX_PC24C_PEVC_PAD_EVT0         _L(2)
#define PINMUX_PC24C_PEVC_PAD_EVT0  ((PIN_PC24C_PEVC_PAD_EVT0 << 16) | MUX_PC24C_PEVC_PAD_EVT0)
#define GPIO_PC24C_PEVC_PAD_EVT0  _UL(1 << 24)
#define PIN_PA09C_PEVC_PAD_EVT1         _L(9) /**< \brief PEVC signal: PAD_EVT1 on PA09 mux C */
#define MUX_PA09C_PEVC_PAD_EVT1         _L(2)
#define PINMUX_PA09C_PEVC_PAD_EVT1  ((PIN_PA09C_PEVC_PAD_EVT1 << 16) | MUX_PA09C_PEVC_PAD_EVT1)
#define GPIO_PA09C_PEVC_PAD_EVT1  _UL(1 <<  9)
#define PIN_PB13C_PEVC_PAD_EVT1        _L(45) /**< \brief PEVC signal: PAD_EVT1 on PB13 mux C */
#define MUX_PB13C_PEVC_PAD_EVT1         _L(2)
#define PINMUX_PB13C_PEVC_PAD_EVT1  ((PIN_PB13C_PEVC_PAD_EVT1 << 16) | MUX_PB13C_PEVC_PAD_EVT1)
#define GPIO_PB13C_PEVC_PAD_EVT1  _UL(1 << 13)
#define PIN_PC08C_PEVC_PAD_EVT1        _L(72) /**< \brief PEVC signal: PAD_EVT1 on PC08 mux C */
#define MUX_PC08C_PEVC_PAD_EVT1         _L(2)
#define PINMUX_PC08C_PEVC_PAD_EVT1  ((PIN_PC08C_PEVC_PAD_EVT1 << 16) | MUX_PC08C_PEVC_PAD_EVT1)
#define GPIO_PC08C_PEVC_PAD_EVT1  _UL(1 <<  8)
#define PIN_PC25C_PEVC_PAD_EVT1        _L(89) /**< \brief PEVC signal: PAD_EVT1 on PC25 mux C */
#define MUX_PC25C_PEVC_PAD_EVT1         _L(2)
#define PINMUX_PC25C_PEVC_PAD_EVT1  ((PIN_PC25C_PEVC_PAD_EVT1 << 16) | MUX_PC25C_PEVC_PAD_EVT1)
#define GPIO_PC25C_PEVC_PAD_EVT1  _UL(1 << 25)
#define PIN_PA10C_PEVC_PAD_EVT2        _L(10) /**< \brief PEVC signal: PAD_EVT2 on PA10 mux C */
#define MUX_PA10C_PEVC_PAD_EVT2         _L(2)
#define PINMUX_PA10C_PEVC_PAD_EVT2  ((PIN_PA10C_PEVC_PAD_EVT2 << 16) | MUX_PA10C_PEVC_PAD_EVT2)
#define GPIO_PA10C_PEVC_PAD_EVT2  _UL(1 << 10)
#define PIN_PC11C_PEVC_PAD_EVT2        _L(75) /**< \brief PEVC signal: PAD_EVT2 on PC11 mux C */
#define MUX_PC11C_PEVC_PAD_EVT2         _L(2)
#define PINMUX_PC11C_PEVC_PAD_EVT2  ((PIN_PC11C_PEVC_PAD_EVT2 << 16) | MUX_PC11C_PEVC_PAD_EVT2)
#define GPIO_PC11C_PEVC_PAD_EVT2  _UL(1 << 11)
#define PIN_PC26C_PEVC_PAD_EVT2        _L(90) /**< \brief PEVC signal: PAD_EVT2 on PC26 mux C */
#define MUX_PC26C_PEVC_PAD_EVT2         _L(2)
#define PINMUX_PC26C_PEVC_PAD_EVT2  ((PIN_PC26C_PEVC_PAD_EVT2 << 16) | MUX_PC26C_PEVC_PAD_EVT2)
#define GPIO_PC26C_PEVC_PAD_EVT2  _UL(1 << 26)
#define PIN_PB09B_PEVC_PAD_EVT2        _L(41) /**< \brief PEVC signal: PAD_EVT2 on PB09 mux B */
#define MUX_PB09B_PEVC_PAD_EVT2         _L(1)
#define PINMUX_PB09B_PEVC_PAD_EVT2  ((PIN_PB09B_PEVC_PAD_EVT2 << 16) | MUX_PB09B_PEVC_PAD_EVT2)
#define GPIO_PB09B_PEVC_PAD_EVT2  _UL(1 <<  9)
#define PIN_PA11C_PEVC_PAD_EVT3        _L(11) /**< \brief PEVC signal: PAD_EVT3 on PA11 mux C */
#define MUX_PA11C_PEVC_PAD_EVT3         _L(2)
#define PINMUX_PA11C_PEVC_PAD_EVT3  ((PIN_PA11C_PEVC_PAD_EVT3 << 16) | MUX_PA11C_PEVC_PAD_EVT3)
#define GPIO_PA11C_PEVC_PAD_EVT3  _UL(1 << 11)
#define PIN_PC27C_PEVC_PAD_EVT3        _L(91) /**< \brief PEVC signal: PAD_EVT3 on PC27 mux C */
#define MUX_PC27C_PEVC_PAD_EVT3         _L(2)
#define PINMUX_PC27C_PEVC_PAD_EVT3  ((PIN_PC27C_PEVC_PAD_EVT3 << 16) | MUX_PC27C_PEVC_PAD_EVT3)
#define GPIO_PC27C_PEVC_PAD_EVT3  _UL(1 << 27)
#define PIN_PB10B_PEVC_PAD_EVT3        _L(42) /**< \brief PEVC signal: PAD_EVT3 on PB10 mux B */
#define MUX_PB10B_PEVC_PAD_EVT3         _L(1)
#define PINMUX_PB10B_PEVC_PAD_EVT3  ((PIN_PB10B_PEVC_PAD_EVT3 << 16) | MUX_PB10B_PEVC_PAD_EVT3)
#define GPIO_PB10B_PEVC_PAD_EVT3  _UL(1 << 10)
/* ========== GPIO definition for SCIF peripheral ========== */
#define PIN_PA19E_SCIF_GCLK0           _L(19) /**< \brief SCIF signal: GCLK0 on PA19 mux E */
#define MUX_PA19E_SCIF_GCLK0            _L(4)
#define PINMUX_PA19E_SCIF_GCLK0    ((PIN_PA19E_SCIF_GCLK0 << 16) | MUX_PA19E_SCIF_GCLK0)
#define GPIO_PA19E_SCIF_GCLK0    _UL(1 << 19)
#define PIN_PB10E_SCIF_GCLK0           _L(42) /**< \brief SCIF signal: GCLK0 on PB10 mux E */
#define MUX_PB10E_SCIF_GCLK0            _L(4)
#define PINMUX_PB10E_SCIF_GCLK0    ((PIN_PB10E_SCIF_GCLK0 << 16) | MUX_PB10E_SCIF_GCLK0)
#define GPIO_PB10E_SCIF_GCLK0    _UL(1 << 10)
#define PIN_PC26E_SCIF_GCLK0           _L(90) /**< \brief SCIF signal: GCLK0 on PC26 mux E */
#define MUX_PC26E_SCIF_GCLK0            _L(4)
#define PINMUX_PC26E_SCIF_GCLK0    ((PIN_PC26E_SCIF_GCLK0 << 16) | MUX_PC26E_SCIF_GCLK0)
#define GPIO_PC26E_SCIF_GCLK0    _UL(1 << 26)
#define PIN_PA02A_SCIF_GCLK0            _L(2) /**< \brief SCIF signal: GCLK0 on PA02 mux A */
#define MUX_PA02A_SCIF_GCLK0            _L(0)
#define PINMUX_PA02A_SCIF_GCLK0    ((PIN_PA02A_SCIF_GCLK0 << 16) | MUX_PA02A_SCIF_GCLK0)
#define GPIO_PA02A_SCIF_GCLK0    _UL(1 <<  2)
#define PIN_PA20E_SCIF_GCLK1           _L(20) /**< \brief SCIF signal: GCLK1 on PA20 mux E */
#define MUX_PA20E_SCIF_GCLK1            _L(4)
#define PINMUX_PA20E_SCIF_GCLK1    ((PIN_PA20E_SCIF_GCLK1 << 16) | MUX_PA20E_SCIF_GCLK1)
#define GPIO_PA20E_SCIF_GCLK1    _UL(1 << 20)
#define PIN_PB11E_SCIF_GCLK1           _L(43) /**< \brief SCIF signal: GCLK1 on PB11 mux E */
#define MUX_PB11E_SCIF_GCLK1            _L(4)
#define PINMUX_PB11E_SCIF_GCLK1    ((PIN_PB11E_SCIF_GCLK1 << 16) | MUX_PB11E_SCIF_GCLK1)
#define GPIO_PB11E_SCIF_GCLK1    _UL(1 << 11)
#define PIN_PC27E_SCIF_GCLK1           _L(91) /**< \brief SCIF signal: GCLK1 on PC27 mux E */
#define MUX_PC27E_SCIF_GCLK1            _L(4)
#define PINMUX_PC27E_SCIF_GCLK1    ((PIN_PC27E_SCIF_GCLK1 << 16) | MUX_PC27E_SCIF_GCLK1)
#define GPIO_PC27E_SCIF_GCLK1    _UL(1 << 27)
#define PIN_PB12E_SCIF_GCLK2           _L(44) /**< \brief SCIF signal: GCLK2 on PB12 mux E */
#define MUX_PB12E_SCIF_GCLK2            _L(4)
#define PINMUX_PB12E_SCIF_GCLK2    ((PIN_PB12E_SCIF_GCLK2 << 16) | MUX_PB12E_SCIF_GCLK2)
#define GPIO_PB12E_SCIF_GCLK2    _UL(1 << 12)
#define PIN_PC28E_SCIF_GCLK2           _L(92) /**< \brief SCIF signal: GCLK2 on PC28 mux E */
#define MUX_PC28E_SCIF_GCLK2            _L(4)
#define PINMUX_PC28E_SCIF_GCLK2    ((PIN_PC28E_SCIF_GCLK2 << 16) | MUX_PC28E_SCIF_GCLK2)
#define GPIO_PC28E_SCIF_GCLK2    _UL(1 << 28)
#define PIN_PB13E_SCIF_GCLK3           _L(45) /**< \brief SCIF signal: GCLK3 on PB13 mux E */
#define MUX_PB13E_SCIF_GCLK3            _L(4)
#define PINMUX_PB13E_SCIF_GCLK3    ((PIN_PB13E_SCIF_GCLK3 << 16) | MUX_PB13E_SCIF_GCLK3)
#define GPIO_PB13E_SCIF_GCLK3    _UL(1 << 13)
#define PIN_PC29E_SCIF_GCLK3           _L(93) /**< \brief SCIF signal: GCLK3 on PC29 mux E */
#define MUX_PC29E_SCIF_GCLK3            _L(4)
#define PINMUX_PC29E_SCIF_GCLK3    ((PIN_PC29E_SCIF_GCLK3 << 16) | MUX_PC29E_SCIF_GCLK3)
#define GPIO_PC29E_SCIF_GCLK3    _UL(1 << 29)
#define PIN_PA23E_SCIF_GCLK_IN0        _L(23) /**< \brief SCIF signal: GCLK_IN0 on PA23 mux E */
#define MUX_PA23E_SCIF_GCLK_IN0         _L(4)
#define PINMUX_PA23E_SCIF_GCLK_IN0  ((PIN_PA23E_SCIF_GCLK_IN0 << 16) | MUX_PA23E_SCIF_GCLK_IN0)
#define GPIO_PA23E_SCIF_GCLK_IN0  _UL(1 << 23)
#define PIN_PB14E_SCIF_GCLK_IN0        _L(46) /**< \brief SCIF signal: GCLK_IN0 on PB14 mux E */
#define MUX_PB14E_SCIF_GCLK_IN0         _L(4)
#define PINMUX_PB14E_SCIF_GCLK_IN0  ((PIN_PB14E_SCIF_GCLK_IN0 << 16) | MUX_PB14E_SCIF_GCLK_IN0)
#define GPIO_PB14E_SCIF_GCLK_IN0  _UL(1 << 14)
#define PIN_PC30E_SCIF_GCLK_IN0        _L(94) /**< \brief SCIF signal: GCLK_IN0 on PC30 mux E */
#define MUX_PC30E_SCIF_GCLK_IN0         _L(4)
#define PINMUX_PC30E_SCIF_GCLK_IN0  ((PIN_PC30E_SCIF_GCLK_IN0 << 16) | MUX_PC30E_SCIF_GCLK_IN0)
#define GPIO_PC30E_SCIF_GCLK_IN0  _UL(1 << 30)
#define PIN_PA24E_SCIF_GCLK_IN1        _L(24) /**< \brief SCIF signal: GCLK_IN1 on PA24 mux E */
#define MUX_PA24E_SCIF_GCLK_IN1         _L(4)
#define PINMUX_PA24E_SCIF_GCLK_IN1  ((PIN_PA24E_SCIF_GCLK_IN1 << 16) | MUX_PA24E_SCIF_GCLK_IN1)
#define GPIO_PA24E_SCIF_GCLK_IN1  _UL(1 << 24)
#define PIN_PB15E_SCIF_GCLK_IN1        _L(47) /**< \brief SCIF signal: GCLK_IN1 on PB15 mux E */
#define MUX_PB15E_SCIF_GCLK_IN1         _L(4)
#define PINMUX_PB15E_SCIF_GCLK_IN1  ((PIN_PB15E_SCIF_GCLK_IN1 << 16) | MUX_PB15E_SCIF_GCLK_IN1)
#define GPIO_PB15E_SCIF_GCLK_IN1  _UL(1 << 15)
#define PIN_PC31E_SCIF_GCLK_IN1        _L(95) /**< \brief SCIF signal: GCLK_IN1 on PC31 mux E */
#define MUX_PC31E_SCIF_GCLK_IN1         _L(4)
#define PINMUX_PC31E_SCIF_GCLK_IN1  ((PIN_PC31E_SCIF_GCLK_IN1 << 16) | MUX_PC31E_SCIF_GCLK_IN1)
#define GPIO_PC31E_SCIF_GCLK_IN1  _UL(1 << 31)
/* ========== GPIO definition for EIC peripheral ========== */
#define PIN_PB01C_EIC_EXTINT0          _L(33) /**< \brief EIC signal: EXTINT0 on PB01 mux C */
#define MUX_PB01C_EIC_EXTINT0           _L(2)
#define PINMUX_PB01C_EIC_EXTINT0   ((PIN_PB01C_EIC_EXTINT0 << 16) | MUX_PB01C_EIC_EXTINT0)
#define GPIO_PB01C_EIC_EXTINT0   _UL(1 <<  1)
#define PIN_PB01C_EIC_EXTINT_NUM        _L(0) /**< \brief EIC signal: PIN_PB01 External Interrupt Line */
#define PIN_PA06C_EIC_EXTINT1           _L(6) /**< \brief EIC signal: EXTINT1 on PA06 mux C */
#define MUX_PA06C_EIC_EXTINT1           _L(2)
#define PINMUX_PA06C_EIC_EXTINT1   ((PIN_PA06C_EIC_EXTINT1 << 16) | MUX_PA06C_EIC_EXTINT1)
#define GPIO_PA06C_EIC_EXTINT1   _UL(1 <<  6)
#define PIN_PA06C_EIC_EXTINT_NUM        _L(1) /**< \brief EIC signal: PIN_PA06 External Interrupt Line */
#define PIN_PA16C_EIC_EXTINT1          _L(16) /**< \brief EIC signal: EXTINT1 on PA16 mux C */
#define MUX_PA16C_EIC_EXTINT1           _L(2)
#define PINMUX_PA16C_EIC_EXTINT1   ((PIN_PA16C_EIC_EXTINT1 << 16) | MUX_PA16C_EIC_EXTINT1)
#define GPIO_PA16C_EIC_EXTINT1   _UL(1 << 16)
#define PIN_PA16C_EIC_EXTINT_NUM        _L(1) /**< \brief EIC signal: PIN_PA16 External Interrupt Line */
#define PIN_PC24B_EIC_EXTINT1          _L(88) /**< \brief EIC signal: EXTINT1 on PC24 mux B */
#define MUX_PC24B_EIC_EXTINT1           _L(1)
#define PINMUX_PC24B_EIC_EXTINT1   ((PIN_PC24B_EIC_EXTINT1 << 16) | MUX_PC24B_EIC_EXTINT1)
#define GPIO_PC24B_EIC_EXTINT1   _UL(1 << 24)
#define PIN_PC24B_EIC_EXTINT_NUM        _L(1) /**< \brief EIC signal: PIN_PC24 External Interrupt Line */
#define PIN_PA04C_EIC_EXTINT2           _L(4) /**< \brief EIC signal: EXTINT2 on PA04 mux C */
#define MUX_PA04C_EIC_EXTINT2           _L(2)
#define PINMUX_PA04C_EIC_EXTINT2   ((PIN_PA04C_EIC_EXTINT2 << 16) | MUX_PA04C_EIC_EXTINT2)
#define GPIO_PA04C_EIC_EXTINT2   _UL(1 <<  4)
#define PIN_PA04C_EIC_EXTINT_NUM        _L(2) /**< \brief EIC signal: PIN_PA04 External Interrupt Line */
#define PIN_PA17C_EIC_EXTINT2          _L(17) /**< \brief EIC signal: EXTINT2 on PA17 mux C */
#define MUX_PA17C_EIC_EXTINT2           _L(2)
#define PINMUX_PA17C_EIC_EXTINT2   ((PIN_PA17C_EIC_EXTINT2 << 16) | MUX_PA17C_EIC_EXTINT2)
#define GPIO_PA17C_EIC_EXTINT2   _UL(1 << 17)
#define PIN_PA17C_EIC_EXTINT_NUM        _L(2) /**< \brief EIC signal: PIN_PA17 External Interrupt Line */
#define PIN_PC25B_EIC_EXTINT2          _L(89) /**< \brief EIC signal: EXTINT2 on PC25 mux B */
#define MUX_PC25B_EIC_EXTINT2           _L(1)
#define PINMUX_PC25B_EIC_EXTINT2   ((PIN_PC25B_EIC_EXTINT2 << 16) | MUX_PC25B_EIC_EXTINT2)
